Attack(
  (search_method): GeneticAlgorithm(
    (pop_size):  60
    (max_iters):  20
    (temp):  0.3
    (give_up_if_no_improvement):  False
  )
  (goal_function):  UntargetedClassification
  (transformation):  WordSwapEmbedding(
    (max_candidates):  8
    (embedding_type):  paragramcf
  )
  (constraints): 
    (0): MaxWordsPerturbed(
        (max_percent):  0.2
      )
    (1): WordEmbeddingDistance(
        (embedding_type):  paragramcf
        (max_mse_dist):  0.5
        (cased):  False
        (include_unknown_words):  True
      )
    (2): LearningToWriteLanguageModel(
        (max_log_prob_diff):  5.0
      )
    (3): RepeatModification
    (4): StopwordModification
  (is_black_box):  True
) 

--------------------------------------------- Result 1 ---------------------------------------------
[92mPositive (100%)[0m --> [91mNegative (66%)[0m

this [92mkind[0m of hands-on [92mstorytelling[0m is ultimately what makes shanghai ghetto move beyond a good , dry , reliable [92mtextbook[0m and what allows it to rank with its [92mworthy[0m predecessors .

this [91msort[0m of hands-on [91mtale[0m is ultimately what makes shanghai ghetto move beyond a good , dry , reliable [91mmanuals[0m and what allows it to rank with its [91mcreditable[0m predecessors .


--------------------------------------------- Result 2 ---------------------------------------------
[92mPositive (80%)[0m --> [91mNegative (98%)[0m

making such a tragedy the [92mbackdrop[0m to a love story risks trivializing it , [92mthough[0m chouraqui no doubt intended the film to affirm love's power to help people endure almost unimaginable horror .

making such a tragedy the [91mbackground[0m to a love story risks trivializing it , [91mnotwithstanding[0m chouraqui no doubt intended the film to affirm love's power to help people endure almost unimaginable horror .


--------------------------------------------- Result 3 ---------------------------------------------
[92mPositive (92%)[0m --> [91mNegative (76%)[0m

[92mgrown[0m-up quibbles are beside the point here . the little girls [92munderstand[0m , and mccracken knows that's all that matters .

[91mincreased[0m-up quibbles are beside the point here . the little girls [91munderstands[0m , and mccracken knows that's all that matters .



+-------------------------------+--------+
| Attack Results                |        |
+-------------------------------+--------+
| Number of successful attacks: | 3      |
| Number of failed attacks:     | 0      |
| Number of skipped attacks:    | 0      |
| Original accuracy:            | 100.0% |
| Accuracy under attack:        | 0.0%   |
| Attack success rate:          | 100.0% |
| Average perturbed word %:     | 10.01% |
| Average num. words per input: | 27.0   |
| Avg num queries:              | 522.33 |
+-------------------------------+--------+
