Attack(
  (search_method): BeamSearch(
    (beam_width):  10
  )
  (goal_function):  UntargetedClassification
  (transformation):  WordSwapGradientBased(
    (top_n):  1
  )
  (constraints): 
    (0): MaxWordsPerturbed(
        (max_num_words):  2
      )
    (1): WordEmbeddingDistance(
        (embedding_type):  paragramcf
        (min_cos_sim):  0.8
        (cased):  False
        (include_unknown_words):  True
      )
    (2): PartOfSpeech(
        (tagset):  universal
        (allow_verb_noun_swap):  True
      )
    (3): RepeatModification
    (4): StopwordModification
  (is_black_box):  False
) 

--------------------------------------------- Result 1 ---------------------------------------------
[92m1[0m-->[91m[FAILED][0m

lovingly photographed in the manner of a golden book sprung to life , stuart little 2 manages sweetness largely without stickiness .


--------------------------------------------- Result 2 ---------------------------------------------
[92m1[0m-->[91m[FAILED][0m

consistently clever and suspenseful .


--------------------------------------------- Result 3 ---------------------------------------------
[92m1[0m-->[91m[FAILED][0m

it's like a " big chill " reunion of the baader-meinhof gang , only these guys are more harmless pranksters than political activists .


--------------------------------------------- Result 4 ---------------------------------------------
[92m1[0m-->[91m0[0m

the story gives ample opportunity for large-scale action and suspense , which director shekhar [92mkapur[0m supplies with tremendous skill .

the story gives ample opportunity for large-scale action and suspense , which director shekhar [91munwilling[0m supplies with tremendous skill .



+-------------------------------+--------+
| Attack Results                |        |
+-------------------------------+--------+
| Number of successful attacks: | 1      |
| Number of failed attacks:     | 3      |
| Number of skipped attacks:    | 0      |
| Original accuracy:            | 100.0% |
| Accuracy under attack:        | 75.0%  |
| Attack success rate:          | 25.0%  |
| Average perturbed word %:     | 5.26%  |
| Average num. words per input: | 16.0   |
| Avg num queries:              | 1.25   |
+-------------------------------+--------+
