Attack(
  (search_method): GeneticAlgorithm(
    (pop_size):  60
    (max_iters):  20
    (temp):  0.3
    (give_up_if_no_improvement):  False
  )
  (goal_function):  UntargetedClassification
  (transformation):  WordSwapEmbedding(
    (max_candidates):  8
    (embedding_type):  paragramcf
  )
  (constraints): 
    (0): MaxWordsPerturbed(
        (max_percent):  0.2
      )
    (1): WordEmbeddingDistance(
        (embedding_type):  paragramcf
        (max_mse_dist):  0.5
        (cased):  False
        (include_unknown_words):  True
      )
    (2): LearningToWriteLanguageModel(
        (max_log_prob_diff):  5.0
      )
    (3): RepeatModification
    (4): StopwordModification
  (is_black_box):  True
) 

--------------------------------------------- Result 1 ---------------------------------------------
[92mPositive (100%)[0m --> [91mNegative (74%)[0m

this kind of hands-on [92mstorytelling[0m is ultimately what makes shanghai [92mghetto[0m move beyond a good , dry , [92mreliable[0m textbook and what [92mallows[0m it to rank with its worthy predecessors .

this kind of hands-on [91mtale[0m is ultimately what makes shanghai [91mslum[0m move beyond a good , dry , [91mcredible[0m textbook and what [91mallowed[0m it to rank with its worthy predecessors .


--------------------------------------------- Result 2 ---------------------------------------------
[92mPositive (80%)[0m --> [91mNegative (100%)[0m

making such a tragedy the backdrop to a love story risks trivializing it , [92mthough[0m chouraqui no doubt intended the film to affirm love's power to help people endure [92malmost[0m unimaginable horror .

making such a tragedy the backdrop to a love story risks trivializing it , [91mnotwithstanding[0m chouraqui no doubt intended the film to affirm love's power to help people endure [91mabout[0m unimaginable horror .


--------------------------------------------- Result 3 ---------------------------------------------
[92mPositive (92%)[0m --> [91mNegative (52%)[0m

grown-up quibbles are beside the point here . the [92mlittle[0m [92mgirls[0m [92munderstand[0m , and mccracken [92mknows[0m that's all that [92mmatters[0m .

grown-up quibbles are beside the point here . the [91msmall[0m [91mgirl[0m [91munderstanding[0m , and mccracken [91mrealises[0m that's all that [91mquestions[0m .



+-------------------------------+--------+
| Attack Results                |        |
+-------------------------------+--------+
| Number of successful attacks: | 3      |
| Number of failed attacks:     | 0      |
| Number of skipped attacks:    | 0      |
| Original accuracy:            | 100.0% |
| Accuracy under attack:        | 0.0%   |
| Attack success rate:          | 100.0% |
| Average perturbed word %:     | 16.17% |
| Average num. words per input: | 25.67  |
| Avg num queries:              | 837.67 |
+-------------------------------+--------+
